{
    "code": [
        {
            "title": "Particle.js",
            "github": "https://github.com/karanjitsingh/particle.js",
            "desc": "Particle.js is a JavaScript canvas library for fancy particle animations. The fun animations you see on the main page of this website use Particle.js at its core. You can checkout another implementation of particle.js at <a target=\"_blank\" href=\"https://www.headout.com/careers\">Headout's careers page</a>.",
            "img": "./images/particlejs.png",
            "link": "",
            "year": "2017"
        },
        {
            "title": "SVG Path Parser",
            "github": "https://github.com/karanjitsingh/svg-path-parser",
            "desc": "SVG path parser is a custom path 2D parser written specifically for Particle.JS to support animation for any specific path. Particle.JS requires path length and nth point for each path element that is created in a path 2D, for this very reason I had to write a custom parser that converts those path elements into custom path functions which provide its length and a method to get the nth point on the path.",
            "img": "./images/svgpathparser.png",
            "link": "",
            "year": "2017"
        },
        {
            "title": "Neural Network to Play 2048",
            "github": "https://github.com/karanjitsingh/dqn-2048",
            "desc": "A reinforcement learning bot written in python that learns to play 2048 from the experience gained from playing it again and again. This project was done for my 6th semester Machine Learning course at Manipal Institute of Technology. The neural network for this project was written from scratch including the TD backpropagation algorithm.",
            "img": "./images/2048.png",
            "link": "",
            "year": "2017"
        },
        {
            "title": "IE CSE Website 2014-2015",
            "github": "https://github.com/karanjitsingh/iecse",
            "desc": "IE CSE is the official computer science club of manipal. Every year IE CSE hosts a website winter project for its new members to rebuild their website. This is the 2014-2015 version of the website. <br />Checkout the <a href=\"http://iecse.karanjitsingh.com\">live version</a>!",
            "img": "./images/iecse.png",
            "link": "",
            "year": "2014"
        },
        {
            "title": "Hospital Management System",
            "github": "",
            "desc": "A hospital management system for a charitable hospital based in Haridwar, India. Over the span of two years 2012-2013, I developed various modules including registration, inventory management, appointment scheduling, patient data maintainance etc, delivering a complete and integrated hospital management system written in .NET Framework and Microsoft SQL Server.",
            "img": "./images/hms.png",
            "link": "",
            "year": "2013"
        },
        {
            "title": "Snakes in Classic C",
            "github": "https://github.com/karanjitsingh/buoyancy/tree/master/Snakes",
            "desc": "My 12th grade final project for Computer Programming in C class. Checkout the <a href=\"/web/snakes\">showcase website</a>.",
            "img": "./images/snakes.png",
            "link": "",
            "year": "2013"
        },
        {
            "title": "Solar System 2D Simulation",
            "github": "",
            "desc": "",
            "img": "",
            "link": "/web/solarsystem",
            "year": "2011"
        },
        {
            "title": "Sudoku Solver",
            "github": "",
            "desc": "",
            "img": "",
            "link": "/web/sudoku",
            "year": "2010"
            
        },
        {
            "title": "Experimental Projects",
            "github": "",
            "desc": "",
            "img": "",
            "link": "/web/experimental",
            "year": "2010"
        }
    ],
    "about": "<span>Hi!</span>I am Karan Jit Singh. I live in <a class=\"location\" target=\"_blank\" href=\"https://www.google.co.in/search?q=Chandigarh+India\">Chandigarh, India</a>, currently pursuing my bachelor's degree in Computer Science and Engineering at Manipal Institute of Technology, Manipal.<br/><br/>My technical interests are Machine Learning, mainly reinforcement leanirng, Math, simulations and fun javascript canvas projects! Apart from enjoying technical stuff, I also enjoy watching Formula 1&#127937;, playing the guitar and frustrating n00bs at counter-strike.<br/><br/><span>Work</span>I spent my last summer interning at Microsoft, working on code coverage reporting and prototyping a hybrid code coverage reporting engine for Visual Studio Team Services. Prior to that, I had interned at Headout migrating their mobile website to ReactJS.<br/></br>Find my official resume <a href=\"https://docs.google.com/document/d/1ywZ06cUI7QjxJCAJ0WXdBG9oCfE4p4GlTlEUleD-F2w/edit?usp=sharing\" target=\"_blank\">here</a>."
}